-- Задание 4
-- Написать следующие запросы к БД:

-- Найти N наиболее посещаемых постов за день/месяц/год.
-- Найти N наиболее посещаемых постов для заданного пользователя за все время, которые создал не он, но которые он редактировал.
-- Найти N пользователей, для которых суммарный рейтинг для всех созданных ими постов максимальный среди всех пользователей.
-- Найти N пользователей, для которых суммарный рейтинг для всех созданных ими постов максимальный среди всех пользователей младше K лет.
-- Найти N пользователей с наибольшим рейтингом.
-- Найти N тэгов, для которых суммарное количество посещений связанных с ними постов наибольшее за неделю.